UniDsproc/UniDsproc/Tests/smev2.base.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<S:Header/>
	<S:Body wsu:Id="body">
		<ws:rpnRequest xmlns:ws="http://rospotrebnadzor.ru/soap/rpnES2" xmlns:smev="http://smev.gosuslugi.ru/rev111111">
			<smev:Message>
				<smev:Sender>
					<smev:Code>CUST01001</smev:Code>
					<smev:Name>Русские буквы</smev:Name>
				</smev:Sender>
				<smev:Recipient>
					<smev:Code>RPTR01001</smev:Code>
					<smev:Name>Русские буквы2</smev:Name>
				</smev:Recipient>
				<smev:Originator>
					<smev:Code>CUST01001</smev:Code>
					<smev:Name>Русские буквы4</smev:Name>
				</smev:Originator>
				<smev:TypeCode>GSRV</smev:TypeCode>
				<smev:Status>REQUEST</smev:Status>
				<smev:Date>2016-08-21T22:39:15.065+03:00</smev:Date>
				<smev:ExchangeType>2</smev:ExchangeType>
				<smev:CaseNumber>5701859</smev:CaseNumber>
			</smev:Message>
			<smev:MessageData>
				<smev:AppData>
					<rpn:getDoc xmlns:rpn="http://rospotrebnadzor.ru/soap/rpnES2">
						<rpn:numb>RU.67.АБ.01.008.ВГ.002920.08.11</rpn:numb>
						<rpn:mode>serial</rpn:mode>
					</rpn:getDoc>
				</smev:AppData>
			</smev:MessageData>
		</ws:rpnRequest>
	</S:Body>
</S:Envelope>
